In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('supershops.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [3]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

In [4]:
mean = df.Transport.mean()                       # Null Valo Fill
medim = df.Transport.median()                    # Null Valo Fill

In [5]:
mean

215331.73244897963

In [6]:
medim

214634.81

In [7]:
df.Transport = df.Transport.fillna(medim)   # Transport  Null Valo  fill added

In [8]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [9]:
df.isnull().sum()                # Transport  Null Valo  fill added

Marketing Spend    0
Administration     0
Transport          0
Area               0
Profit             0
dtype: int64

# Encoding  Number add korte Pari

In [10]:
df.Area.unique()            # Coloumn value deka

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [11]:
df.Area = df.Area.replace(['Dhaka','Ctg','Rangpur'],["Du",'Cu','Ru'])
df.Area.head()

0    Du
1    Cu
2    Ru
3    Du
4    Ru
Name: Area, dtype: object

In [12]:
df.head()

   Marketing Spend  Administration  Transport Area     Profit
0        114523.61       136897.80  471784.10   Du  192261.83
1        162597.70       151377.59  443898.53   Cu  191792.06
2        153441.51       101145.55  407934.54   Ru  191050.39
3        144372.41       118671.85  383199.62   Du  182901.99
4        142107.34        91391.77  366168.42   Ru  166187.94

# Label Encoding  Automatic Number add hobe Tar jonno Import korte nete hobe  'LabelEncoder'

In [13]:
df = pd.read_csv('supershops.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [14]:
from sklearn.preprocessing import LabelEncoder

In [15]:
label = LabelEncoder()
label

LabelEncoder()

In [16]:
df.Area = label.fit_transform(df.Area)

In [17]:
df.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     1  192261.83
1        162597.70       151377.59  443898.53     0  191792.06
2        153441.51       101145.55  407934.54     2  191050.39
3        144372.41       118671.85  383199.62     1  182901.99
4        142107.34        91391.77  366168.42     2  166187.94

# Others  Loop

In [18]:
for colunm in df.columns:
    if df[colunm].dtype == np.number:
        continue
    else:
        df[colunm] == LabelEncoder().fit_transform(df[colunm])

C:\Users\user\AppData\Local\Temp\ipykernel_2584\2646039925.py:2: DeprecationWarning: Converting `np.inexact` or `np.floating` to a dtype is deprecated. The current result is `float64` which is not strictly correct.
  if df[colunm].dtype == np.number:

In [19]:
df.head()

   Marketing Spend  Administration  Transport  Area     Profit
0        114523.61       136897.80  471784.10     1  192261.83
1        162597.70       151377.59  443898.53     0  191792.06
2        153441.51       101145.55  407934.54     2  191050.39
3        144372.41       118671.85  383199.62     1  182901.99
4        142107.34        91391.77  366168.42     2  166187.94

# One Hot Encoding  Use 'Get Dumies ' Function  . "Ctg" Delect hobe ,Area ta ke Drop korbo  tapor Concat korbo

In [20]:
df = pd.read_csv('supershops.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [21]:
dumy_variable = pd.get_dummies(df.Area, drop_first= True)
dumy_variable . head()

   Dhaka  Rangpur
0      1        0
1      0        0
2      0        1
3      1        0
4      0        1

In [22]:
new_df = df.drop('Area', axis = 1)
new_df.head()

   Marketing Spend  Administration  Transport     Profit
0        114523.61       136897.80  471784.10  192261.83
1        162597.70       151377.59  443898.53  191792.06
2        153441.51       101145.55  407934.54  191050.39
3        144372.41       118671.85  383199.62  182901.99
4        142107.34        91391.77  366168.42  166187.94

In [23]:
pd.concat([new_df, dumy_variable], axis = 1)

    Marketing Spend  Administration  Transport     Profit  Dhaka  Rangpur
0         114523.61       136897.80  471784.10  192261.83      1        0
1         162597.70       151377.59  443898.53  191792.06      0        0
2         153441.51       101145.55  407934.54  191050.39      0        1
3         144372.41       118671.85  383199.62  182901.99      1        0
4         142107.34        91391.77  366168.42  166187.94      0        1
5         131876.90        99814.71  362861.36  156991.12      1        0
6         134615.46       147198.87  127716.82  156122.51      0        0
7         130298.13       145530.06  323876.68  155752.60      0        1
8         120542.52       148718.95  311613.29  152211.77      1        0
9         123334.88       108679.17  304981.62  149759.96      0        0
10        101913.08       110594.11  229160.95  146121.95      0        1
11        100671.96        91790.61  249744.55  144259.40      0        0
12         93863.75       127320.38  249839.44  141585.52      0        1
13         91992.39       135495.07  252664.93  134307.35      0        0
14        119943.24       156547.42  256512.92  132602.65      0        1
15        165349.20       122616.84  261776.23  129917.04      1        0
16         78013.11       121597.55  264346.06  126992.93      0        0
17         94657.16       145077.58  282574.31  125370.37      1        0
18         91749.16       114175.79  294919.57  124266.90      0        1
19         86419.70       153514.11        NaN  122776.86      1        0
20         76253.86       113867.30  298664.47  118474.03      0        0
21         78389.47       153773.43  299737.29  111313.02      1        0
22         73994.56       122782.75  303319.26  110352.25      0        1
23         67532.53       105751.03  304768.73  108733.99      0        1
24         77044.01        99281.34  140574.81  108552.04      1        0
25         64664.71       139553.16  137962.62  107404.34      0        0
26         75328.87       144135.98  134050.07  105733.54      0        1
27         72107.60       127864.55  353183.81  105008.31      1        0
28         66051.52       182645.56  118148.20  103282.38      0        1
29         65605.48       153032.06  107138.38  101004.64      1        0
30         61994.48       115641.28   91131.24   99937.59      0        1
31         61136.38       152701.92   88218.23   97483.56      1        0
32         63408.86       129219.61   46085.25   97427.84      0        0
33         55493.95       103057.49  214634.81   96778.92      0        1
34         46426.07       157693.92  210797.67   96712.80      0        0
35         46014.02        85047.44  205517.64   96479.51      1        0
36         28663.76       127056.21  201126.82   90708.19      0        1
37         44069.95        51283.14  197029.42   89949.14      0        0
38         20229.59        65947.93  185265.10   81229.06      1        0
39         38558.51        82982.09  174999.30   81005.76      0        0
40         28754.33       118546.05  172795.67   78239.91      0        0
41         27892.92        84710.77  164470.71   77798.83      0        1
42         23640.93        96189.63  148001.11   71498.49      0        0
43         15505.73       127382.30   35534.17   69758.98      1        0
44         22177.74       154806.14   28334.72   65200.33      0        0
45          1000.23       124153.04    1903.93   64926.08      1        0
46          1315.46       115816.21  297114.46   49490.75      0        1
47             0.00       135426.92       0.00   42559.73      0        0
48           542.05        51743.15       0.00   35673.41      1        0
49             0.00       116983.80   45173.06   14681.40      0        0

# Ordinal Encoding er Jonno Import kore nete hobe 'OrdinalEncoder'

In [24]:
df = pd.read_csv('supershops.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [25]:
df.Area.unique()

array(['Dhaka', 'Ctg', 'Rangpur'], dtype=object)

In [26]:
city_list = ['Dhaka','Ctg','Rangpur']

In [27]:
from sklearn.preprocessing import OrdinalEncoder

In [28]:
ordinal = OrdinalEncoder(categories=[city_list])
ordinal

OrdinalEncoder(categories=[['Dhaka', 'Ctg', 'Rangpur']])

In [29]:
encoded_value = ordinal.fit_transform(df[['Area']])

In [30]:
encoded_value

array([[0.],
       [1.],
       [2.],
       [0.],
       [2.],
       [0.],
       [1.],
       [2.],
       [0.],
       [1.],
       [2.],
       [1.],
       [2.],
       [1.],
       [2.],
       [0.],
       [1.],
       [0.],
       [2.],
       [0.],
       [1.],
       [0.],
       [2.],
       [2.],
       [0.],
       [1.],
       [2.],
       [0.],
       [2.],
       [0.],
       [2.],
       [0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.],
       [1.],
       [0.],
       [1.],
       [1.],
       [2.],
       [1.],
       [0.],
       [1.],
       [0.],
       [2.],
       [1.],
       [0.],
       [1.]])

In [31]:
new-area = pd.DataFrame(encoded_value,columns=['Area'])

SyntaxError: cannot assign to operator (773879730.py, line 1)

In [ ]:
df.Area = new_area

# Hashing Encoder er jonno import kore nete hobe 'Category_encoders '

In [ ]:
df = pd.read_csv('supershops.csv')
df.head()

In [ ]:
#import category_encoders as catenc

In [ ]:
from sklearn.category_encoders import  HashingEncoder

In [34]:
from category_encoders import ce

ModuleNotFoundError: No module named 'category_encoders'

In [35]:
from sklearn.preprocessing import CategoricalEncoder

ImportError: cannot import name 'CategoricalEncoder' from 'sklearn.preprocessing' (C:\ProgramData\Anaconda3\lib\site-packages\sklearn\preprocessing\__init__.py)

In [37]:
pip install category_encoders

Defaulting to user installation because normal site-packages is not writeableNote: you may need to restart the kernel to use updated packages.

Requirement already satisfied: category_encoders in c:\users\user\appdata\roaming\python\python39\site-packages (2.6.0)
Requirement already satisfied: statsmodels>=0.9.0 in c:\programdata\anaconda3\lib\site-packages (from category_encoders) (0.13.2)
Requirement already satisfied: scipy>=1.0.0 in c:\programdata\anaconda3\lib\site-packages (from category_encoders) (1.9.1)
Requirement already satisfied: scikit-learn>=0.20.0 in c:\programdata\anaconda3\lib\site-packages (from category_encoders) (1.0.2)
Requirement already satisfied: numpy>=1.14.0 in c:\programdata\anaconda3\lib\site-packages (from category_encoders) (1.21.5)
Requirement already satisfied: patsy>=0.5.1 in c:\programdata\anaconda3\lib\site-packages (from category_encoders) (0.5.2)
Requirement already satisfied: pandas>=1.0.5 in c:\programdata\anaconda3\lib\site-packages (from category_encoders) (1.4.4)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas>=1.0.5->category_encoders) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\programdata\anaconda3\lib\site-packages (from pandas>=1.0.5->category_encoders) (2.8.2)
Requirement already satisfied: six in c:\programdata\anaconda3\lib\site-packages (from patsy>=0.5.1->category_encoders) (1.16.0)
Requirement already satisfied: joblib>=0.11 in c:\programdata\anaconda3\lib\site-packages (from scikit-learn>=0.20.0->category_encoders) (1.1.0)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\programdata\anaconda3\lib\site-packages (from scikit-learn>=0.20.0->category_encoders) (2.2.0)
Requirement already satisfied: packaging>=21.3 in c:\programdata\anaconda3\lib\site-packages (from statsmodels>=0.9.0->category_encoders) (21.3)
Requirement already satisfied: pyparsing!=3.0.5,>=2.0.2 in c:\programdata\anaconda3\lib\site-packages (from packaging>=21.3->statsmodels>=0.9.0->category_encoders) (3.0.9)

In [44]:
from category_encoders.hashing import HashingEncoder

ModuleNotFoundError: No module named 'category_encoders'

In [40]:
enc = HashingEncoder(cols ='Area')

NameError: name 'HashingEncoder' is not defined